#ifndef __PIC_MANAGER_
#define __PIC_MANAGER_

#include <pic_operation.h>
#include <file.h>


/**********************************************************************
 * º¯ÊıÃû³Æ£º PicPraserRegister
 * ¹¦ÄÜÃèÊö£º ½«tBmpFilePraser½á¹¹Ìå×¢²áµ½Á´±íÖĞ
 * ÊäÈë²ÎÊı£º ptPicFilePraser - ÄÚº¬Í¼Æ¬½âÎöÆ÷µÄ½á¹¹Ìå
 * Êä³ö²ÎÊı£º 
 * ·µ »Ø Öµ£º 0 - ³É¹¦, ÆäËûÖµ - Ê§°Ü
 ***********************************************************************/
int PicPraserRegister(PT_PicFilePraser ptPicFilePraser);

/**********************************************************************
 * º¯ÊıÃû³Æ£º BMPPraserInit
 * ¹¦ÄÜÃèÊö£º ½«tBmpFilePraser½á¹¹Ìå×¢²áµ½Á´±íÖĞ
 * ÊäÈë²ÎÊı£º ptPixelDatas - ÄÚº¬ÏóËØÊı¾İ
 * Êä³ö²ÎÊı£º 
 * ·µ »Ø Öµ£º 0 - ³É¹¦, ÆäËûÖµ - Ê§°Ü
 ***********************************************************************/
int BMPPraserInit(void);


/**********************************************************************
 * º¯ÊıÃû³Æ£º PicPraserRegister
 * ¹¦ÄÜÃèÊö£º ½«tBmpFilePraser½á¹¹Ìå×¢²áµ½Á´±íÖĞ
 * ÊäÈë²ÎÊı£º 
 * Êä³ö²ÎÊı£º 
 * ·µ »Ø Öµ£º 0 - ³É¹¦, ÆäËûÖµ - Ê§°Ü
 ***********************************************************************/
 
 int ShowPicPraser(void);

/**********************************************************************
 * º¯ÊıÃû³Æ£º PicFilePraserRegister
 * ¹¦ÄÜÃèÊö£º ÊäÈëÍ¼Æ¬½âÎöÆ÷µÄÃû×Ö£¬»ñµÃ¸Ã½âÎöÆ÷½âÎöÄ£¿é
 * ÊäÈë²ÎÊı£º pcname - Í¼Æ¬½âÎöÆ÷µÄÃû×Ö£
 * Êä³ö²ÎÊı£º ÎŞ
 * ·µ »Ø Öµ£º PT_PicFilePraser ½âÎöÆ÷½âÎöÄ£¿é½á¹¹ÌåÖ¸Õë
 ***********************************************************************/
PT_PicFilePraser PicPraser(char *pcname);

/**********************************************************************
 * º¯ÊıÃû³Æ£º GetPicParser
 * ¹¦ÄÜÃèÊö£º ÕÒµ½ÄÜÖ§³ÖÖ¸¶¨ÎÄ¼şµÄ"Í¼Æ¬ÎÄ¼ş½âÎöÄ£¿é"(µ÷ÓÃisSupportº¯Êı)
 * ÊäÈë²ÎÊı£º ptFileMap - ÄÚº¬ÎÄ¼şĞÅÏ¢
 * Êä³ö²ÎÊı£º ÎŞ
 * ·µ »Ø Öµ£º NULL   - Ê§°Ü,Ã»ÓĞÖ¸¶¨µÄÄ£¿é, 
 *            ·ÇNULL - Ö§³Ö¸ÃÎÄ¼şµÄ"Í¼Æ¬ÎÄ¼ş½âÎöÄ£¿é"µÄPT_PicFileParser½á¹¹ÌåÖ¸Õë
 ***********************************************************************/
PT_PicFilePraser GetPicPraser(PT_FileMap ptFileMap);


/**********************************************************************
 * º¯ÊıÃû³Æ£º PicPraserInit
 * ¹¦ÄÜÃèÊö£º ³õÊ¼»¯¸÷¸öÍ¼Æ¬½âÎöÄ£¿é
 * ÊäÈë²ÎÊı£º wu
 * Êä³ö²ÎÊı£º ÎŞ
 * ·µ »Ø Öµ£º NULL   - Ê§°Ü,Ã»ÓĞÖ¸¶¨µÄÄ£¿é, 
 *            ·ÇNULL - Ö§³Ö¸ÃÎÄ¼şµÄ"Í¼Æ¬ÎÄ¼ş½âÎöÄ£¿é"µÄPT_PicFileParser½á¹¹ÌåÖ¸Õë
 ***********************************************************************/
int PicPraserInit(void);




#endif

